<?php

return [
	/**
	 * INFO
	 */
	'info' => [
			'SiteName'   => 'Laravel5.3',
			'FooterName' => 'Laravel5.3',
	],
	
	/**
	 * 権限
	 */
	'admin_role' => [
			'ADMINISTRATOR' => 'システム管理者',
			'OPERATOR'	  => '運用担当者',
			'READER'		=> '閲覧専用者',
	],
	
	/**
	 * ステータス
	 */
	'status' => [
			1 => '有効',
			0 => '無効',
	],
	
	/**
	 * アップロードディレクトリ
	 */
	'upload_path' => [
			'postImage'		  => 'uploads/post/',		  // 投稿画像
			'postThumbnail'	  => 'uploads/post/thumbnail/',// 投稿サムネイル
	],
	
	'no_image_path'			  => '/images/no_image_gr.png',   // 登録画像無し
		
	/**
	 * 月
	 */
	'month' => [
			 1 => 1,
			 2 => 2,
			 3 => 3,
			 4 => 4,
			 5 => 5,
			 6 => 6,
			 7 => 7,
			 8 => 8,
			 9 => 9,
			10 => 10,
			11 => 11,
			12 => 12,
	],
		
	/**
	 * 日
	 */
	'day' => [
			 1 => 1,
			 2 => 2,
			 3 => 3,
			 4 => 4,
			 5 => 5,
			 6 => 6,
			 7 => 7,
			 8 => 8,
			 9 => 9,
			10 => 10,
			11 => 11,
			12 => 12,
			13 => 13,
			14 => 14,
			15 => 15,
			16 => 16,
			17 => 17,
			18 => 18,
			19 => 19,
			20 => 20,
			21 => 21,
			22 => 22,
			23 => 23,
			24 => 24,
			25 => 25,
			26 => 26,
			27 => 27,
			28 => 28,
			29 => 29,
			30 => 30,
			31 => 31,
	],
		
	/**
	 * 曜日
	 */
	'week' => [
			0 => '日',
			1 => '月',
			2 => '火',
			3 => '水',
			4 => '木',
			5 => '金',
			6 => '土',
	],
	
	/**
	 * 都道府県
	 */
	'pref' => [
			 1 => '北海道',
			 2 => '青森県',
			 3 => '岩手県',
			 4 => '宮城県',
			 5 => '秋田県',
			 6 => '山形県',
			 7 => '福島県',
			 8 => '茨城県',
			 9 => '栃木県',
			10 => '群馬県',
			11 => '埼玉県',
			12 => '千葉県',
			13 => '東京都',
			14 => '神奈川県',
			15 => '新潟県',
			16 => '富山県',
			17 => '石川県',
			18 => '福井県',
			19 => '山梨県',
			20 => '長野県',
			21 => '岐阜県',
			22 => '静岡県',
			23 => '愛知県',
			24 => '三重県',
			25 => '滋賀県',
			26 => '京都府',
			27 => '大阪府',
			28 => '兵庫県',
			29 => '奈良県',
			30 => '和歌山県',
			31 => '鳥取県',
			32 => '島根県',
			33 => '岡山県',
			34 => '広島県',
			35 => '山口県',
			36 => '徳島県',
			37 => '香川県',
			38 => '愛媛県',
			39 => '高知県',
			40 => '福岡県',
			41 => '佐賀県',
			42 => '長崎県',
			43 => '熊本県',
			44 => '大分県',
			45 => '宮崎県',
			46 => '鹿児島県',
			47 => '沖縄県',
	],
	
];